app/controllers/fornecedors_controller.rb

  def index
    @fornecedors = Fornecedor.all
---
SELECT "fornecedors".* FROM "fornecedors"

    def set_fornecedor
      @fornecedor = Fornecedor.find(params[:id])
---
SELECT "fornecedors".* FROM "fornecedors" WHERE "fornecedors"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]