app/controllers/produtos_controller.rb

  def index
    @produtos = Produto.all
---
SELECT "produtos".* FROM "produtos"

    def set_produto
      @produto = Produto.find(params[:id])
---
SELECT "produtos".* FROM "produtos" WHERE "produtos"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]